In [3]:
import pandas as pd

In [127]:
data2022=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2022.xlsx")
data2021=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2021.xlsx")
data2020=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2020.xlsx")
data2019=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2019.xlsx")
data2018=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2018.xlsx")
data2017=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2017.xlsx")
data2016=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2016.xlsx")
data2015=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2015.xlsx")
data2014=pd.read_excel("./input/서울/서울특별시･산업별_중분류__퇴사인력__구인_및_채용인력_미충원인력_등__2014.xlsx")

c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
c:\Users\dawoo\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [174]:
# data2014 = data2014.drop("산업별(1)", axis=1)
# data2014.iloc[0:1, 0:4]

# data2014
# data2014.set_index()
# data2014 = data2014.set_index(2014)
# data2014 = data2014.drop(columns="산업별(1)")

data2014 = data2014.rename(
    columns={"Unnamed: 2": "경력자", "Unnamed: 3": "입사 경력자", "Unnamed: 4": "신입"})
data_2014 = data2014.iloc[2:3, 0:3]
data_2014

# data2014

         경력자 입사 경력자    신입
2014
20540  15827    571  4714

In [172]:
data2015
# data2015 = data2015.drop("산업별(1)", axis=1)
# data2015=data2015.set_index("2015")
data2015 = data2015.rename(
    columns={"2015.1": "경력자", "2015.2": "입사 경력자", "2015.3": "신입"})
data_2015 = data2015.iloc[2:3, 0:3]
data_2015

         경력자 입사 경력자    신입
2015
25848  17708    888  8140

In [170]:
# data2016
# data2016 = data2016.drop("산업별(1)", axis=1)
# data2016 = data2016.set_index("2016")
data2016 = data2016.rename(
    columns={"2016.1": "경력자", "2016.2": "입사 경력자", "2016.3": "신입"})
data_2016 = data2016.iloc[2:3, 0:3]
data_2016

         경력자 입사 경력자    신입
2016
25603  19114   1642  6489

In [148]:
# data2017=data2017.set_index("2017")
# data2017 = data2017.drop("산업별(1)", axis=1)
data2017 = data2017.rename(
    columns={"2017.1": "경력자", "2017.2": "입사 경력자", "2017.3": "신입"})
data_2017 = data2017.iloc[2:3, 0:3]
data_2017

         경력자 입사 경력자    신입
2017
26401  19672   1764  6730

In [151]:
# data2018=data2018.set_index("2018")
# data2018 = data2018.drop("산업별(1)", axis=1)
data2018 = data2018.rename(
    columns={"2018.1": "경력자", "2018.2": "입사 경력자", "2018.3": "신입"})
data_2018 = data2018.iloc[2:3, 0:3]
data_2018

         경력자 입사 경력자    신입
2018
27546  21811   1756  5735

In [153]:
# data2019=data2019.set_index("2019")
# data2019 = data2019.drop("산업별(1)", axis=1)
data2019 = data2019.rename(
    columns={"2019.1": "경력자", "2019.2": "입사 경력자", "2019.3": "신입"})
data_2019 = data2019.iloc[2:3, 0:3]
data_2019

         경력자 입사 경력자    신입
2019
29586  21328   2229  8258

In [155]:
# data2020=data2020.set_index("2020")
# data2020 = data2020.drop("산업별(1)", axis=1)
data2020 = data2020.rename(
    columns={"2020.1": "경력자", "2020.2": "입사 경력자", "2020.3": "신입"})
data_2020 = data2020.iloc[2:3, 0:3]
data_2020

         경력자 입사 경력자    신입
2020
26164  18665   1871  7500

In [157]:
# data2021=data2.set_index("2021")
# data2021 = data2021.drop("산업021별(1)", axis=1)
data2021 = data2021.rename(

    columns={"2021.1": "경력자", "2021.2": "입사 경력자", "2021.3": "신입"})

data_2021 = data2021.iloc[2:3, 0:3]
data_2021

         경력자 입사 경력자    신입
2021
26422  18394   2151  8028

In [159]:
# data2022=data2022.set_index("2022")
# data2022 = data2022.drop("산업별(1)", axis=1)
data2022 = data2022.rename(
    columns={"2022.1": "경력자", "2022.2": "입사 경력자", "2022.3": "신입"})
data_2022 = data2022.iloc[2:3, 0:3]
data_2022

         경력자 입사 경력자    신입
2022
31955  24727   2747  7229